import React from "react";

const Donors = () => {
  return (
    <div className="my-4 md:my-8">
      <h2 className="text-3xl font-semibold text-center my-4">
        দাতা সদস্যদের তালিকা
      </h2>
      <p className="w-10/12 md:w-8/12 mx-auto text-center border-b-2 pb-2">
        <span className="font-semibold">বিঃ দ্রঃ</span> যিনি ৫০০০০ হাজার বা তার
        অধিক টাকা এক-কালীন মাদ্রাসায় দান করবেন তিনি মাদ্রাসার ভূমিদাতা হিসেবে
        গণ্য হবেন এবং যিনি ২৫০০০ হাজার বা তার অধিক টাকা এক-কালীন মাদ্রাসায় দান
        করবেন তিনি মাদ্রাসার দাতা সদস্য হিসেবে গণ্য হবেন।
      </p>
      <div className="md:flex">
        <div className="md:w-1/2 p-4">
          <h2 className=" text-center font-semibold my-2">
            ভূমিদাতা সদস্যদের তালিকা
          </h2>
          <div className="overflow-x-auto">
            <table className="table table-xs">
              <thead>
                <tr>
                  <th>ক্র: </th>
                  <th>নাম</th>
                  <th>ঠিকানা</th>
                  <th>পরিমান</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th>০১</th>
                  <td>জনাব আব্দুন নূর সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০২</th>
                  <td>জনাব আব্দুল হান্নান সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৮.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৩</th>
                  <td>জনাব আজাদ মিয়া সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫৮,৪০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৪</th>
                  <td>জনাবা নূরজাহান বেগম</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫৮,৪০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৫</th>
                  <td>জনাব সুহেল ইসলাম সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>১,০০০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৬</th>
                  <td>জনাব সাব্বির আহমদ সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৭</th>
                  <td>জনাব ডা. মাহবুবুল ইসলাম সাহেব</td>
                  <td>মেনিখলা, দক্ষিণ সুরমা, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৮</th>
                  <td>জনাব মরহুম বাহাদুর খান সাহেব</td>
                  <td>শিওরখাল, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৯</th>
                  <td>জনাব মো. নাসির খান সাহেব</td>
                  <td>শিওরখাল, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১০</th>
                  <td>জনাবা ময়মুন নেসা খান শিরিয়া</td>
                  <td>খাগদিওর (তালুকদার বাড়ী), ওসমানীনগর, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১১</th>
                  <td>জনাব মরহুম আতিকুর রহমান সাহেব</td>
                  <td>আলাপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১২</th>
                  <td>জনাবা ফারহা মুশাররাত বুশরা</td>
                  <td>আলাপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১৩</th>
                  <td>জনাব আব্দুল বাহার সেলু সাহেব</td>
                  <td>জামালপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১৪</th>
                  <td>জনাব আব্দুল আজিজ মাসুক সাহেব</td>
                  <td>খাঁপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১৫</th>
                  <td>জনাব মরহুম আব্দুল খালিক সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৬০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১৬</th>
                  <td>জনাব আহবাবুর রহমান খান মিরন সাহেব</td>
                  <td>আনোয়ারপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৬০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১৭</th>
                  <td>জনাব রেজওয়ান আলী কয়েস সাহেব</td>
                  <td>শিওরখাল, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১৮</th>
                  <td>জনাবা জাহানারা বেগম</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১৯</th>
                  <td>মরহুম সালেহা বেগম</td>
                  <td>খাগদিওর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>২০</th>
                  <td>মাও. রেজওয়ানুল হক্ব চৌধুরী রাজু সাহেব</td>
                  <td>সুলতানপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>২১</th>
                  <td>মাও. নজরুল ইসলাম সাহেব</td>
                  <td>মোল্লাপাড়া, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,৫২০/= টাকা</td>
                </tr>
                <tr>
                  <th>২২</th>
                  <td>হাজী মিনার মিয়া সাহেব</td>
                  <td>কুরুগাঁও, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>২৩</th>
                  <td>মোছা. জাকীয়া ইয়াছমিন</td>
                  <td>আলাপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫১,৮৬৫/= টাকা</td>
                </tr>
                <tr>
                  <th>২৪</th>
                  <td>জনাব জহির মিয়া বাবুল সাহেব</td>
                  <td>কান্দিগাঁও, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>২৫</th>
                  <td>জনাব লাল মিয়া সাহেব</td>
                  <td>কুরুগাঁও, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>২৬</th>
                  <td>মরহুম হাজী আব্দুর রাজ্জাক সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>২৭</th>
                  <td>জনাব আশিক মিয়া সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৫০,০০০/= টাকা</td>
                </tr>
              </tbody>
            </table>
          </div>
        </div>
        <div className="md:w-1/2 p-4">
          <h2 className=" text-center font-semibold my-2">
            দাতা সদস্যদের তালিকা
          </h2>
          <div className="overflow-x-auto">
            <table className="table table-xs">
              <thead>
                <tr>
                  <th>ক্র: </th>
                  <th>নাম</th>
                  <th>ঠিকানা</th>
                  <th>পরিমান</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th>০১</th>
                  <td>জনাব এম এ খালিক সাহেব</td>
                  <td>বুরাইয়া, ছাতক, সুনামগঞ্জ।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০২</th>
                  <td>জনাব সাজুল ইসলাম সাহেব</td>
                  <td>বড়জামাত, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>২৯,২০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৩</th>
                  <td>জনাব আহাদ মিয়া সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৪</th>
                  <td>জনাবা রুকিয়া খান</td>
                  <td>শিওরখাল, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৫</th>
                  <td>জনাব মরহুম তফা মিয়া সাহেব</td>
                  <td>মোল্লাপাড়া, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৬</th>
                  <td>জনাব সহুল এ-মুনিম সাহেব</td>
                  <td>বরকতপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৭</th>
                  <td>জনাব মাও. সৈয়দ শিব্বির আহমদ সাহেব</td>
                  <td>সৈয়দপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩১,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৮</th>
                  <td>জনাব হাম্মাদ আলী সাহেব</td>
                  <td>বরকতপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৪৮,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>০৯</th>
                  <td>মাও. কামাল আহমদ সাহেব রাহ.</td>
                  <td>কুরুগাঁও, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১০</th>
                  <td>জনাব ফরহাদ চৌধুরী সাহেব</td>
                  <td>শিওরখাল, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১১</th>
                  <td>জনাব ইব্রাহিম আলী সাহেব</td>
                  <td>খাগদিওর (তালুকদারবাড়ী), ওসমানীনগর, সিলেট।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১২</th>
                  <td>বেফাকুল মাদারিসিল আরাবিয়া বাংলাদেশ</td>
                  <td>বেফাক অফিস, ঢাকা,বাংলাদেশ।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১৩</th>
                  <td>মাষ্টার মিজানুর রহমান পংকি</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১৪</th>
                  <td>মাও. আব্দুল মুকিত সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>২৫,০০০/= টাকা</td>
                </tr>
                <tr>
                  <th>১৫</th>
                  <td>এম আর ওয়ারিছ সাহেব</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>অস্থায়ী ভবনের সম্পূর্ণ ইট। </td>
                </tr>
                <tr>
                  <th>১৬</th>
                  <td>জনাব জাহানারা বেগম</td>
                  <td>রাইকদাড়া, দয়ামীর, ওসমানীনগর, সিলেট।</td>
                  <td>রাস্তা মেরামত।</td>
                </tr>
              </tbody>
            </table>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Donors;
