import React from "react";

const Donors = () => {
  return (
    <div className="my-4 md:my-8">
      <h2 className="text-3xl font-semibold text-center my-4">
        দাতা সদস্যদের তালিকা
      </h2>
      <p className="w-10/12 md:w-8/12 mx-auto text-center border-b-2 pb-2">
        <span className="font-semibold">বিঃ দ্রঃ</span> যিনি ৫০০০০ হাজার বা তার
        অধিক টাকা এক-কালীন মাদ্রাসায় দান করবেন তিনি মাদ্রাসার ভূমিদাতা হিসেবে
        গণ্য হবেন এবং যিনি ২৫০০০ হাজার বা তার অধিক টাকা এক-কালীন মাদ্রাসায় দান
        করবেন তিনি মাদ্রাসার দাতা সদস্য হিসেবে গণ্য হবেন।
      </p>
      <div className="md:flex">
        <div className="md:w-1/2 p-4">
          <h2 className=" text-center font-semibold my-2">
            ভূমিদাতা সদস্যদের তালিকা
          </h2>
          <div className="overflow-x-auto">
            <table className="table table-xs">
              <thead>
                <tr>
                  <th>ক্র: </th>
                  <th>নাম</th>
                  <th>ঠিকানা</th>
                  <th>পরিমান</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th>০১</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০২</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৩</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৪</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৫</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৬</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৭</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৮</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৯</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১০</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১১</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১২</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১৩</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১৪</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১৫</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
              </tbody>
            </table>
          </div>
        </div>
        <div className="md:w-1/2 p-4">
          <h2 className=" text-center font-semibold my-2">
            দাতা সদস্যদের তালিকা
          </h2>
          <div className="overflow-x-auto">
            <table className="table table-xs">
              <thead>
                <tr>
                  <th>ক্র: </th>
                  <th>নাম</th>
                  <th>ঠিকানা</th>
                  <th>পরিমান</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th>০১</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০২</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৩</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৪</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৫</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৬</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৭</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৮</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>০৯</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১০</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১১</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১২</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১৩</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১৪</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
                <tr>
                  <th>১৫</th>
                  <td>হাজী আব্দুন নূর</td>
                  <td>রতনপুর, গহরপুর, বালাগঞ্জ, সিলেট।</td>
                  <td>৩.৫ শতক</td>
                </tr>
              </tbody>
            </table>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Donors;
